Repository: fablee1/dca-bot
Catalog: locales/*/LC_MESSAGES/dcabot.po
Languages: ru

source: No quests to display.
ru: Квестов ещё нет.

source: Quest from
ru: Квест от

source: Quest not solved! 🕐
ru: Квест не решён! 🕐

source: Quest is solved! ✅
ru: Квест решён! ✅

source: Difficulty
ru: Сложность

source: No news to display.
ru: Новостей ещё нет.

source: News from
ru: Новость от

source: Title/desc english
ru: Описание на английском

source: Title/desc russian
ru: Описание на русском

source: English url
ru: Английская ссылка

source: Russian url
ru: Русская ссылка

source: This is your admin panel. Using the buttons below, you can manage quests, news, apps and look for stats.
ru: Это твоя админ панель. Используя кнопки ниже, ты можешь редактировать квесты, новости, приложения и посмотреть на статистику.

source: Incorrect username format. Please use /set_admin @username
ru: Неверный формат юзернэйма. Пожалуйста используй /set_admin @юзернэйм

source: This person is admin now!
ru: Этот человек теперь админ!

source: This user is not in the database, please ask him to start the bot first!
ru: Этот юзер не найден в базе данных, пожалуйста попроси его сначала включить бота!

source: Incorrect username format. Please use /del_admin @username
ru: Неверный формат юзернейма. Пожалуйста используй /del_admin @юзернейм

source: This person is no more an admin!
ru: Этот человек больше не админ!

source: Enter quest date in format DD-MM-YYYY or type '-' to assign today's date, or press /cancel
ru: Введи дату квеста в формате ДД-ММ-ГГГГ или отправь '-' чтобы автоматически ввести сегодняшнюю дату, или нажми /cancel

source: Incorrect date format. Try again.
ru: Неверный формат даты. Попробуй ещё раз.

source: Quest date is: {date} Now enter quest url or press /cancel
ru: Дата квеста: {date} Теперь введи ссылку на квест или нажми /cancel

source: Quest url is: [{url}]({url}) Now enter quest difficulty from 0 to 100 or press /cancel
ru: Ссылка на квест: [{url}]({url}) Теперь введи сложность квеста от 0 до 100 или нажми /cancel

source: Quest difficulty is: {diff} Now check quest: Date: {date} Url: [{url}]({url}) Difficulty: {diff} If everything is correct press confirm or press /cancel
ru: Сложность квеста: {diff} Теперь проверь созданный квест: Дата: {date} Ссылка: [{url}]({url}) Сложность: {diff} Если всё правильно нажми подтвердить или нажми /cancel

source: Error, this must be a number between 0 and 100. Try again.
ru: Ошибка, это должно быть число от 0 до 100. Попробуй ещё раз.

source: Admin menu.
ru: Админ панель.

source: Enter new date in format DD-MM-YYYY:
ru: Введи новую дату в формате ДД-ММ-ГГГГ:

source: Enter new url:
ru: Введи новую ссылку:

source: Enter new difficulty from 0 to 100:
ru: Введи новую сложность от 0 до 100:

source: Should be number between 0 and 100
ru: Должно быть число между 0 и 100

source: Choose hint:
ru: Выбери подсказку:

source: Choose hint language:
ru: Выберите язык подсказки:

source: Hint {n} was deleted! Choose another hint to edit or press finish button.
ru: Подсказка {n} удалена! Выбери ещё одну подсказку чтобы отредактировать или нажми закончить.

source: Please enter hint:
ru: Введи подсказку:

source: This hint is: {hint}
ru: Эта подсказка: {hint}

source: Length of hint is {l} chars. Length should be less than or equal to 200 chars. Try again.
ru: Длина подсказки {l} знаков. Длина должна быть меньше либо равна 200 знакам. Попробуй ещё раз.

source: Hint {n} {lang} was created! Choose another hint to edit or press finish button.
ru: Подсказка {n} {lang} была создана! Выбери ещё одну подсказку чтобы отредактировать или нажми закончить.

source: Admin panel.
ru: Админ панель.

source: Choose platform to edit:
ru: Выбери платформу для редактирования:

source: Enter app url for {p} platform:
ru: Введи ссылку на приложение для {p} платформы:

source: Platform {p} url is: {url}
ru: Платформы {p} ссылка: {url}

source: Enter news date in format DD-MM-YYYY or type '-' to assign today's date, or press /cancel
ru: Введи дату новости в формате ДД-ММ-ГГГГ или введи '-' чтобы автоматически ввести сегодняшнюю дату, или нажми /cancel

source: News date is: {date} Now enter news english Title/Description or press /cancel
ru: Дата новости: {date} Теперь введи описание новости на английском или нажми /cancel

source: News english desc: {desc} Now enter news russian Title/Description or press /cancel
ru: Описание английской новости: {desc} Теперь введи описание новости на русском или нажми /cancel

source: News russian desc: {desc} Now enter news english url or press /cancel
ru: Описание новости на русском: {desc} Теперь введи ссылку на английскую новость или нажми /cancel

source: News english url: {url} Now enter news russian url or press /cancel
ru: Ссылка английской новости: {url} Теперь введи ссылку на русскую новость или нажми /cancel

source: News russian url is: {url_ru} Now check news: Date: {date} Url eng: [{url}]({url}) Url rus: [{url_ru}]({url_ru}) Description eng: {desc} Description rus: {desc_ru} If everything is correct press confirm or press /cancel
ru: Ссылка на русскую новость: {url_ru} Теперь проверь новость: Дата: {date} Английская ссылка: [{url}]({url}) Русская ссылка: [{url_ru}]({url_ru}) Английское описание: {desc} Русское описание: {desc_ru} Если всё правильно нажми подтвердить или нажми /cancel

source: Enter new Title/Description:
ru: Введи новое Название/Описание:

source: 📊 Stats 📊 🔍 Quests: {q_n} 📰 News: {n_n} 🐸 Users: {u_n} 💼 Admins: {a_l}
ru: 📊 Статистика 📊 🔍 Квесты: {q_n} 📰 Новости: {n_n} 🐸 Пользователи: {u_n} 💼 Админы: {a_l}

source: anno_enter_en
ru: Введи английский анонс

source: anno_enter_ru
ru: Введи русский анонс

source: anno_img
ru: Пришли мне картинку анонса если она нужна.

source: anno_confirm
ru: Английский анонс: {anno_en} Русский анонс: {anno_ru}

source: Mailing finished.
ru: Рассылка закончена

source: Quest not solved\! 🕐
ru: Квест не решён\! 🕐

source: Quest is solved\! ✅
ru: Квест решён\! ✅

source: {num} {date_str} Difficulty: {diff}/100 {sol}
ru: {num} {date_str} Сложность: {diff}/100 {sol}

source: No news to display
ru: Новостей ещё нет

source: News
ru: Новости

source: Stay tuned! Coming soon...
ru: Будь в курсе! Скоро...

source: how_to_solve
ru: <b>🔥 Что такое DCA?</b> DCA это проект, который создаёт квесты с призами в криптовалюте. <b>🔥 Как начать?</b> Все наши квесты начинаются с QR кода который ты можешь отсканировать в нашем боте, после этого ты попадёшь в квест. Твой путь начинается сейчас и теперь тебе надо будет проверить твои навыки, знания и смекалку. Мы используем различные способы чтобы спрятать приз, начиная с прятания ссылок, QR кодов, лёгких загадок и базовой логики для лёгких квестов, заканчивая различными видами шифрования алгоритмов, кодировок, криптографии, стеганографии и различных шифров. Чаще всего ты получишь сид фразу из 12-ти слов от мульти-монетного криптокошелька, но в будущих квестах мы не исключаем приватные ключи, фразы из 24-х слов, пароли к ним и тд. <b>🔥 Что вы используете в квестах и где я могу узнать об этом подробнее?</b> Чаще всего мы используем алгоримы шифрования AES и RC4, а также энигму и много другого в будущем. Ты можешь почитать онлайн о криптографии и стеганографии. - Для AES и RC4 мы используем <a href="http://crypt-online.ru/crypts/">ССЫЛКА</a> - Для различных шифров ты можешь посмотреть <a href="https://www.dcode.fr/en">ССЫЛКА</a> - Про стеганографию можешь почитать тут <a href="https://ru.wikipedia.org/wiki/%D0%A1%D1%82%D0%B5%D0%B3%D0%B0%D0%BD%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D1%8F">ССЫЛКА</a> - Не забудь также про разные преобразования и шифры по тексту. <b>🔥 Вы даёте подсказки?</b> Если квест продолжительное количество времени остаётся не решённым, мы добавим до 4 подсказок для каждого квеста, которые вы можете найти нажав на кнопку Квесты, где под каждым квестом вы найдёте соответствующие подсказки, так что будь на чеку и частенько проверяй бота. <b>🔥 Где я могу найти решение прошлых квестов?</b> В данный момент их нет, но сейчас мы активно работаем над добавлением решений для всех решённых пазлов, что бы ты мог узнать что-то новое и быть готовым решать новые квесты! <b>🔥 Что с призом?</b> Мы не разглашаем приз квеста, но будь уверен он зависит от сложности квеста. Насчёт того в какой криптовалюте приз, ты также узнаешь введя сид фразу в кошелёк. В основном наши призы варьируются от 15-300$ <b>🔥 Удачи!</b> <i>"Разум твой предел. Пока разум может представить факт того что ты что-то можешь, ты это сделаешь, пока веришь в это на все 100 процентов."</i> -<b>Арнольд Шварценеггер</b>

source: Here you can find our apps! Download them to make the most from our quests.
ru: Здесь ты можешь найти ссылки на наши приложения! Скачай их, чтобы выжать максимум из наших квестов.

source: Choose your language:
ru: Выберите ваш язык:

source: 🇬🇧 Your language is now english! 🇬🇧
ru: 🇷🇺 Ваш язык теперь русский! 🇷🇺

source: :wave: Welcome to the DCA quest bot. :rocket: DCA - Digital Crypto Art is a project dedicated to make interesting quests by testing your skills and knowledge. In our quests you can win big and small depending on the difficulty of the quests. The prize can be in any cryptocurrency. :information_source: Here you can find our latest news, as well as our latest quests.
ru: :wave: Добро пожаловать в квест бот DCA. :rocket: DCA - Digital Crypto Art это проект посвящённый созданию интересных квестов, которые проверят твои знания и смекалку. В наших квестах ты можешь выиграть как большие так и маленькие призы, в зависимости от сложности квеста. Приз может быть в любой криптовалюте. :information_source: Здесь ты можешь найти наши последние новости и квесты.

source: App for this platform is coming soon. Please stay updated!
ru: Приложение для этой платформы скоро появится. Жди обновлений!

source: Send me your qr code.
ru: Пришли мне свой QR код.

source: No qr found, try again!
ru: QR код не найден, попробуй ещё раз!

source: Hint
ru: Подск.

source: Cancel
ru: Отменить

source: Confirm
ru: Подтвердить

source: 🔍 Quests
ru: 🔍 Квесты

source: 🗞 News
ru: 🗞 Новости

source: How to solve❓
ru: Как решать❓

source: 📱 Apps
ru: 📱 Приложения

source: 💽 Scan QR
ru: 💽 Отсканировать QR

source: 🌐 Website
ru: 🌐 Вебсайт

source: ⚙️ Language
ru: ⚙️ Язык

source: ⬇️ More news ⬇️
ru: ⬇️ Больше новостей ⬇️

source: Add quest
ru: Добавить квест

source: Edit quests and hints
ru: Отред. квесты и подсказки

source: Back
ru: Назад

source: Add news
ru: Добавить новости

source: Edit news
ru: Ред. новости

source: Quests
ru: Квесты

source: App
ru: Приложения

source: Stats
ru: Статистика

source: Announcement
ru: Анонс

source: Exit admin panel
ru: Выйти из админ панели.

source: Start again
ru: Начать заново

source: Edit
ru: Ред.

source: Delete
ru: Удалить

source: Hint 💡
ru: Подск. 💡

source: ⬇️ More quests ⬇️
ru: ⬇️ Больше квестов ⬇️

source: Finish
ru: Закончить

source: Edit date
ru: Ред. дату

source: Edit url
ru: Ред. ссылку

source: Edit diff
ru: Ред. сложность

source: Edit hints
ru: Ред. подсказки

source: Unsolved ❌
ru: Квест не решён! 🕐

source: Solved ✅
ru: Квест решён! ✅

source: Prev page
ru: Пред. страница

source: Next page
ru: След. страница

source: Exit
ru: Выйти

source: Edit english url
ru: Ред. Англ. ссылку

source: Edit english desc
ru: Ред. Англ. описание

source: Edit russian url
ru: Ред. Рус. ссылку

source: Edit russian desc
ru: Ред. Рус. описание
